mdhardenburgh/Blinky/Packages/.cache/NXP.LPC55S69_DFP.12.0.0.pdsc
    <condition id="device.LPC55S69_AND_driver.lpc_dma">
      <accept Dname="LPC55S69*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dma"/>
    </condition>
    <condition id="device.LPC55S69_AND_driver.common">
      <accept Dname="LPC55S69*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="device.LPC55S69_AND_driver.common_AND_driver.flexcomm_i2c">
      <accept Dname="LPC55S69*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
    </condition>
    <condition id="device.LPC55S69_AND_component.lists_AND_driver.common">
      <accept Dname="LPC55S69*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
    </condition>
    <condition id="device.LPC55S69_AND_component.serial_manager_AND_core_type.cm33_AND_driver.common">
      <accept Dname="LPC55S69*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager"/>
      <require Dcore="Cortex-M33"/>
    </condition>
    <condition id="device.LPC55S69_AND_driver.flexcomm_usart">
      <accept Dname="LPC55S69*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="usart"/>
    </condition>
    <condition id="device.LPC55S69_AND_driver.common_AND_driver.flexcomm_AND_driver.flexcomm_usart">
      <accept Dname="LPC55S69*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="usart"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexcomm"/>
    </condition>
    <condition id="device.LPC55S69_AND_driver.codec_AND_driver.wm8904">
      <accept Dname="LPC55S69*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="wm8904"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
    </condition>
    <condition id="device.LPC55S69_AND_CMSIS_Include_core_cm33">
      <accept Dname="LPC55S69*" Dvendor="NXP:11"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="core_id.cm33_core0_AND_core_type.cm33_AND_mdk">
      <require Tcompiler="ARMCC"/>
      <require Dcore="Cortex-M33"/>
      <require Pname="cm33_core0" Dname="LPC55S69*"/>
    </condition>
    <condition id="core_id.cm33_core1_AND_core_type.cm33_AND_mdk">
      <require Tcompiler="ARMCC"/>
      <require Dcore="Cortex-M33"/>
      <require Pname="cm33_core1" Dname="LPC55S69*"/>
    </condition>
    <condition id="core_id.cm33_core0_AND_core_type.cm33_AND_iar">
      <require Tcompiler="IAR"/>
      <require Dcore="Cortex-M33"/>
      <require Pname="cm33_core0" Dname="LPC55S69*"/>
    </condition>
    <condition id="core_id.cm33_core1_AND_core_type.cm33_AND_iar">
      <require Tcompiler="IAR"/>
      <require Dcore="Cortex-M33"/>
      <require Pname="cm33_core1" Dname="LPC55S69*"/>
    </condition>
    <condition id="core_id.cm33_core0_OR_core_id.cm33_core1">
      <accept Pname="cm33_core0" Dname="LPC55S69*"/>
      <accept Pname="cm33_core1" Dname="LPC55S69*"/>
    </condition>
    <condition id="_core_id.cm33_core0_OR_core_id.cm33_core1__AND_core_type.cm33">
      <require Dcore="Cortex-M33"/>
      <require condition="core_id.cm33_core0_OR_core_id.cm33_core1"/>
    </condition>
    <condition id="core_id.cm33_core0_AND_core_type.cm33">
      <require Dcore="Cortex-M33"/>
      <require Pname="cm33_core0" Dname="LPC55S69*"/>
    </condition>
    <condition id="core_id.cm33_core1_AND_core_type.cm33">
      <require Dcore="Cortex-M33"/>
      <require Pname="cm33_core1" Dname="LPC55S69*"/>
    </condition>
    <condition id="device.LPC55S69_AND_driver.common_AND_driver.power">
      <accept Dname="LPC55S69*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="power"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="device.LPC55S69_AND_CMSIS_Driver_Include.I2C_AND_RTE_Device_AND_driver.flexcomm_i2c_dma">
      <accept Dname="LPC55S69*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_dma"/>
      <require Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.3.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
    </condition>
    <condition id="device.LPC55S69_AND_CMSIS_Driver_Include.SPI_AND_RTE_Device_AND_driver.flexcomm_spi_dma">
      <accept Dname="LPC55S69*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="spi_dma"/>
      <require Cclass="CMSIS Driver" Cgroup="SPI" Capiversion="2.2.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
    </condition>
    <condition id="device.LPC55S69_AND_CMSIS_Driver_Include.USART_AND_RTE_Device_AND_driver.flexcomm_usart_dma">
      <accept Dname="LPC55S69*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="usart_dma"/>
      <require Cclass="CMSIS Driver" Cgroup="USART" Capiversion="2.3.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
    </condition>
    <condition id="device.LPC55S69_AND_device.LPC55S69_CMSIS_AND_driver.clock_AND_driver.reset">
      <accept Dname="LPC55S69*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="Startup"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="reset"/>
    </condition>
    <condition id="device.LPC55S69_AND_driver.common_AND_driver.flexcomm">
      <accept Dname="LPC55S69*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexcomm"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
