mdhardenburgh/Blinky/Packages/.cache/NXP.LPC55S69_DFP.12.0.0.pdsc
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_swo" Cversion="1.0.0" condition="device.LPC55S69_AND_component.serial_manager_AND_core_type.cm33_AND_driver.common">
      <description/>
      <files>
        <file category="sourceC" name="components/serial_manager/serial_port_swo.c"/>
        <file category="header" name="components/serial_manager/serial_port_swo.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_uart" Cversion="1.0.0" condition="device.LPC55S69_AND_driver.flexcomm_usart">
      <description/>
      <files>
        <file category="sourceC" name="components/serial_manager/serial_port_uart.c"/>
        <file category="header" name="components/serial_manager/serial_port_uart.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="usart_adapter" Cversion="1.0.0" condition="device.LPC55S69_AND_driver.common_AND_driver.flexcomm_AND_driver.flexcomm_usart">
      <description/>
      <files>
        <file category="header" name="components/uart/uart.h"/>
        <file category="sourceC" name="components/uart/usart_adapter.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8904_adapter" Cversion="2.1.0" condition="device.LPC55S69_AND_driver.codec_AND_driver.wm8904">
      <description/>
      <files>
        <file category="sourceC" name="components/codec/port/wm8904/fsl_codec_adapter.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="device.LPC55S69_AND_CMSIS_Include_core_cm33">
      <description/>
      <files>
        <file condition="core_id.cm33_core0_AND_core_type.cm33_AND_mdk" category="sourceAsm" attr="config" name="arm/startup_LPC55S69_cm33_core0.s"/>
        <file condition="core_id.cm33_core1_AND_core_type.cm33_AND_mdk" category="sourceAsm" attr="config" name="arm/startup_LPC55S69_cm33_core1.s"/>
        <file condition="core_id.cm33_core0_AND_core_type.cm33_AND_iar" category="sourceAsm" attr="config" name="iar/startup_LPC55S69_cm33_core0.s"/>
        <file condition="core_id.cm33_core1_AND_core_type.cm33_AND_iar" category="sourceAsm" attr="config" name="iar/startup_LPC55S69_cm33_core1.s"/>
        <file condition="core_id.cm33_core0_AND_core_type.cm33_AND_mdk" category="linkerScript" attr="config" name="arm/LPC55S69_cm33_core0_flash.scf"/>
        <file condition="core_id.cm33_core0_AND_core_type.cm33_AND_mdk" category="linkerScript" attr="config" name="arm/LPC55S69_cm33_core0_flash_ns.scf"/>
        <file condition="core_id.cm33_core0_AND_core_type.cm33_AND_mdk" category="linkerScript" attr="config" name="arm/LPC55S69_cm33_core0_flash_s.scf"/>
        <file condition="core_id.cm33_core0_AND_core_type.cm33_AND_mdk" category="linkerScript" attr="config" name="arm/LPC55S69_cm33_core0_ram.scf"/>
        <file condition="core_id.cm33_core1_AND_core_type.cm33_AND_mdk" category="linkerScript" attr="config" name="arm/LPC55S69_cm33_core1_flash.scf"/>
        <file condition="core_id.cm33_core1_AND_core_type.cm33_AND_mdk" category="linkerScript" attr="config" name="arm/LPC55S69_cm33_core1_ram.scf"/>
        <file condition="core_id.cm33_core1_AND_core_type.cm33_AND_mdk" category="linkerScript" attr="config" name="arm/LPC55S69_cm33_core1_ram_s.scf"/>
        <file condition="core_id.cm33_core0_AND_core_type.cm33_AND_iar" category="linkerScript" attr="config" name="iar/LPC55S69_cm33_core0_flash.icf"/>
        <file condition="core_id.cm33_core0_AND_core_type.cm33_AND_iar" category="linkerScript" attr="config" name="iar/LPC55S69_cm33_core0_flash_ns.icf"/>
        <file condition="core_id.cm33_core0_AND_core_type.cm33_AND_iar" category="linkerScript" attr="config" name="iar/LPC55S69_cm33_core0_flash_s.icf"/>
        <file condition="core_id.cm33_core0_AND_core_type.cm33_AND_iar" category="linkerScript" attr="config" name="iar/LPC55S69_cm33_core0_ram.icf"/>
        <file condition="core_id.cm33_core1_AND_core_type.cm33_AND_iar" category="linkerScript" attr="config" name="iar/LPC55S69_cm33_core1_flash.icf"/>
        <file condition="core_id.cm33_core1_AND_core_type.cm33_AND_iar" category="linkerScript" attr="config" name="iar/LPC55S69_cm33_core1_ram.icf"/>
        <file condition="core_id.cm33_core1_AND_core_type.cm33_AND_iar" category="linkerScript" attr="config" name="iar/LPC55S69_cm33_core1_ram_s.icf"/>
        <file condition="_core_id.cm33_core0_OR_core_id.cm33_core1__AND_core_type.cm33" category="header" attr="config" name="fsl_device_registers.h"/>
        <file condition="core_id.cm33_core0_AND_core_type.cm33" category="header" attr="config" name="LPC55S69_cm33_core0.h"/>
        <file condition="core_id.cm33_core0_AND_core_type.cm33" category="header" attr="config" name="LPC55S69_cm33_core0_features.h"/>
        <file condition="core_id.cm33_core0_AND_core_type.cm33" category="sourceC" attr="config" name="system_LPC55S69_cm33_core0.c"/>
        <file condition="core_id.cm33_core0_AND_core_type.cm33" category="header" attr="config" name="system_LPC55S69_cm33_core0.h"/>
        <file condition="core_id.cm33_core1_AND_core_type.cm33" category="header" attr="config" name="LPC55S69_cm33_core1.h"/>
        <file condition="core_id.cm33_core1_AND_core_type.cm33" category="header" attr="config" name="LPC55S69_cm33_core1_features.h"/>
        <file condition="core_id.cm33_core1_AND_core_type.cm33" category="sourceC" attr="config" name="system_LPC55S69_cm33_core1.c"/>
        <file condition="core_id.cm33_core1_AND_core_type.cm33" category="header" attr="config" name="system_LPC55S69_cm33_core1.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="anactrl" Cversion="2.0.0" condition="device.LPC55S69_AND_driver.common">
      <description>anactrl Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_anactrl.c"/>
        <file category="header" name="drivers/fsl_anactrl.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="casper" Cversion="2.0.2" condition="device.LPC55S69_AND_driver.common">
      <description>CASPER Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_casper.c"/>
        <file category="header" name="drivers/fsl_casper.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="clock" Cversion="2.1.0" condition="device.LPC55S69_AND_driver.common_AND_driver.power">
      <description>Clock Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_clock.c"/>
        <file category="header" name="drivers/fsl_clock.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="cmp_1" Cversion="2.0.0" condition="device.LPC55S69_AND_driver.common">
      <description>cmp_1 Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_cmp.c"/>
        <file category="header" name="drivers/fsl_cmp.h"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="I2C" Csub="flexcomm_i2c_cmsis" Cversion="2.0.0" condition="device.LPC55S69_AND_CMSIS_Driver_Include.I2C_AND_RTE_Device_AND_driver.flexcomm_i2c_dma">
      <description>I2C CMSIS Driver</description>
      <files>
        <file category="sourceC" name="cmsis_drivers/fsl_i2c_cmsis.c"/>
        <file category="header" name="cmsis_drivers/fsl_i2c_cmsis.h"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="SPI" Csub="flexcomm_spi_cmsis" Cversion="2.0.0" condition="device.LPC55S69_AND_CMSIS_Driver_Include.SPI_AND_RTE_Device_AND_driver.flexcomm_spi_dma">
      <description>SPI CMSIS Driver</description>
      <files>
        <file category="sourceC" name="cmsis_drivers/fsl_spi_cmsis.c"/>
        <file category="header" name="cmsis_drivers/fsl_spi_cmsis.h"/>
      </files>
    </component>
