mdhardenburgh/Blinky/Packages/.cache/NXP.LPC55S69_DFP.12.0.0.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="PRINCE" Cversion="2.0.0" condition="device.LPC55S69_AND_driver.common_AND_driver.iap1_AND_driver.puf">
      <description>PRINCE Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_prince.c"/>
        <file category="header" name="drivers/fsl_prince.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="PUF" Cversion="2.0.1" condition="device.LPC55S69_AND_driver.common">
      <description>PUF Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_puf.c"/>
        <file category="header" name="drivers/fsl_puf.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="reset" Cversion="2.0.1" condition="device.LPC55S69_AND_driver.common">
      <description>Reset Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_reset.c"/>
        <file category="header" name="drivers/fsl_reset.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="rng" Cversion="2.0.0" condition="device.LPC55S69_AND_driver.common">
      <description>RNG Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_rng.c"/>
        <file category="header" name="drivers/fsl_rng.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="sctimer" Cversion="2.1.0" condition="device.LPC55S69_AND_driver.common">
      <description>SCT Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_sctimer.c"/>
        <file category="header" name="drivers/fsl_sctimer.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="sdif" Cversion="2.0.11" condition="device.LPC55S69_AND_driver.common">
      <description>sdif Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_sdif.c"/>
        <file category="header" name="drivers/fsl_sdif.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="sysctl" Cversion="2.0.2" condition="device.LPC55S69_AND_driver.common">
      <description>SYSCTL Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_sysctl.c"/>
        <file category="header" name="drivers/fsl_sysctl.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="utick" Cversion="2.0.2" condition="device.LPC55S69_AND_driver.common">
      <description>UTICK Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_utick.c"/>
        <file category="header" name="drivers/fsl_utick.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8904" Cversion="2.1.0" condition="device.LPC55S69_AND_component.codec_i2c_AND_driver.common">
      <description/>
      <files>
        <file category="sourceC" name="components/codec/wm8904/fsl_wm8904.c"/>
        <file category="header" name="components/codec/wm8904/fsl_wm8904.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wwdt" Cversion="2.1.2" condition="device.LPC55S69_AND_driver.common">
      <description>WWDT Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_wwdt.c"/>
        <file category="header" name="drivers/fsl_wwdt.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="assert" Cversion="1.0.0" condition="device.LPC55S69_AND_utility.debug_console">
      <description/>
      <files>
        <file category="sourceC" name="utilities/fsl_assert.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console" Cversion="1.0.0" condition="device.LPC55S69_AND_component.serial_manager_AND_driver.common">
      <description/>
      <files>
        <file category="sourceC" name="utilities/debug_console/fsl_debug_console.c"/>
        <file category="header" name="utilities/debug_console/fsl_debug_console.h"/>
        <file category="header" name="utilities/debug_console/fsl_debug_console_conf.h"/>
        <file category="sourceC" name="utilities/str/fsl_str.c"/>
        <file category="header" name="utilities/str/fsl_str.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="notifier" Cversion="1.0.0" condition="device.LPC55S69_AND_driver.common">
      <description/>
      <files>
        <file category="sourceC" name="utilities/fsl_notifier.c"/>
        <file category="header" name="utilities/fsl_notifier.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="shell" Cversion="1.0.0" condition="device.LPC55S69_AND_component.lists_AND_driver.common_AND_utility.debug_console">
      <description/>
      <files>
        <file category="sourceC" name="utilities/fsl_shell.c"/>
        <file category="header" name="utilities/fsl_shell.h"/>
      </files>
    </component>
  </components>
</package>
